Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/ced.en.utf8.tmx
Source language: en
Languages: chr

source: The boys are playing ball.
chr: Ꮎ ᎠᏂᏧᏣ ᏍᏆᏞᏍᏗ ᏓᎾᏁᎶᎲᏍᎦ.

source: Roosters crow at dawn.
chr: ᏥᏔᎦ ᎠᏂᏨᏯ ᎤᎩᏥᏍᏕᏱ ᎠᎾᏴᎪᎢ.

source: How much does one rick of wood cost?
chr: ᎯᎳ ᏧᎬᏩᎶᏗ ᏌᏊ ᎢᎦᏒᏘ ᎠᏓ?

source: He's thinking about raising chicks.
chr: ᏥᏔᎦ ᎠᏂᏓ ᏧᏛᎯᏍᏙᏗ ᎠᏓᏅᏖᎭ.

source: When he threw the ball down, it bounced.
chr: ᎡᎳᏗ ᏭᏗᎾ ᏍᏆᏞᏍᏗ ᎤᏓᏗᏅᏒᎢ.

source: I see a lame man limping.
chr: ᎠᏲᎤᏟᎠ ᎠᏍᎦᏯ ᎠᏓᏕᎬ ᏥᎪᏮᏘᎭ.

source: The ball player is bouncing the ball hard.
chr: Ꮎ ᎠᎳᏍᎦᎵᏍᎩ ᏍᏓᏱ ᎠᏓᏗᏅᏗᎭ ᏍᏆᏞᏍᏗ.

source: She put on a pretty belt when she went to town.
chr: ᎤᏬᏚᎯ ᎠᏓᏠᏍᏗ ᎤᏓᏠᏢᎢ ᏗᎦᏚᎲ ᎤᏪᎾ.

source: I got a belt for Christmas.
chr: ᎠᏓᏠᏍᏗ ᎠᎩᏁᏒ ᏓᏂᏍᏓᏲᎯᎲᎢ.

source: The preacher asked for prayers.
chr: ᎠᏓᏙᎵᏍᏗ ᎤᏔᏲᏢ ᎠᎵᏣᏙᎲᏍᎩ.

source: He prays three times a day.
chr: ᏦᎢ ᎢᏳᏩᎩᏗ ᎠᏓᏙᎵᏍᏗᏍᎪ ᏏᎦ.

source: She bought tender green beans at the store. A very young child drinks only milk.
chr: ᎠᏂᏓᎨ ᏚᏯ ᎠᏂᏤ ᏚᏩᏒ ᏗᏓᎾᏅᎢ. ᎠᏓᎨ ᎠᏲᏟ ᎤᏅᏗᏊ ᎢᎦ ᎠᏗᏔᏍᎪᎢ

source: Love is important.
chr: ᎠᏓᎨᏴᏗ ᎤᎵᏍᎨᏓ.

source: Some pills are killers if too many are swallowed.
chr: ᎢᎦᏓ ᏗᎩᏍᏗ ᎠᎾᏓᎯᎯ ᏥᏈᏍᏗ ᏱᏓᎩᏌ.

source: He gave his wife a new purse.
chr: ᎢᏤ ᎠᏓᏟᏁᏌᎵᏗ ᎤᏅᏁᎸ ᎤᏍᏓᏴᎲᏍᎩ.

source: When it's close to Christmas, people shop for gifts.
chr: ᏓᏂᏍᏓᏲᎯᎲ ᎾᎥ ᏱᎩ, ᏗᏓᏁᏗ ᎠᎾᏓᏁᎠᏁᏒᎲᏍᎪ ᏴᏫ.

source: She wants to fan herself, but she has no fan.
chr: ᎤᏓᏃᏰᏗ ᎤᏚᎵ ᎠᏎᏅ Ꮭ ᎠᏓᏃᏲ ᏳᏩᏯ.

source: It's hot. Plug in the fan.
chr: ᎤᏗᏞᎦ. ᎱᏓᎸᎥᎦ ᎠᏓᏃᏲ.

source: This isn't my home. I'm just visiting.
chr: Ꮭ ᎠᏴ ᎠᏇᏅᏒ ᏱᎩ ᎠᎭᏂ. ᎦᏓᏩᏛᎯᏙᎭᏊ.

source: When he finished writing letters, he stretched.
chr: ᎤᏍᏆᏓ ᎪᏪᎵ ᏕᎪᏪᎵᏍᎬ, ᎤᏓᏯᏍᏔᏅᎢ.

source: He was cured of his cancer.
chr: ᎠᏓᏰᏍᎩ ᎤᏢᎬ ᎠᏥᏅᏩᏅᎢ.

source: When he was accused of stealing, he denied it. I am denying him because I don't know him.
chr: ᎤᏃᏍᎩᏒ ᎠᎫᎢᏍᏔᎾ, ᎤᏓᏱᎸᎢ. ᏥᏯᏓᏱᎭ, ᏝᎮᏃ ᏱᏥᏲᎵᎦ.

source: The eighth commandment says, "Thou shalt not commit adultery."
chr: ᏣᏁᎵᏁ ᏗᎧᏃᏩᏛᏍᏗ "ᏞᏍᏗ ᏣᏓᏲᏁᎸᎢ" ᎠᏗᎭ.

source: The Bible reproves adultery.
chr: ᎦᎸᏉᏗ ᎪᏪᎵ ᎠᏍᎦᎦ ᎠᏓᏲᏁᏗ.

source: An adulteress is mentioned in chapter eight of the book of John.
chr: ᏣᏂ ᎣᏍᏓ ᎧᏃᎮᏛ ᏣᏁᎵᏁ ᎠᏯᏙᏢ ᎠᏥᏁᎢᏍᏗ ᎠᏓᏲᏁᎯ ᎠᎨᏯ.

source: An old cloth is easy to rip.
chr: ᎤᏪᏘ ᎠᎿᏬ ᎠᎯᏓ ᎨᏐ ᎤᏓᏣᎦᎵᏗ.

source: Some kind of a stinging bug stung him on his hand.
chr: ᎪᎱᏍᏓ ᎤᏍᏗ ᏥᏍᎪᏯ ᎠᏓᏨᎢᏍᎩ ᎤᏩᏨᏴ ᎤᏬᏰᏂ.

source: When he's getting ready to go somewhere, he uses a mirror.
chr: Ꮲ ᎤᏪᏄᏍᏗ ᏯᏛᏅᎢᏍᏗ ᎠᏓᎨᏍᎪᎢ.

source: She has a big mirror on the dresser.
chr: ᎤᏔᎾ ᎠᏓᎨᏗ ᏄᏩᏅᏗ ᏗᏎᎯᏍᏗᎢ.

source: When it's time for them to play ball, the ball game begins.
chr: ᎤᎾᎳᏍᎦᏗ ᏳᏟᎢᎶᏝ ᎠᏓᎴᏂᏍᎪ ᎠᎾᎳᏍᎦᎵᏍᎬᎢ.

source: She wants to do a lot of shopping, but the prices are too high.
chr: ᏥᏈᏍᏗ ᎤᏓᎾᏁᏒᎲᏍᏗ ᎤᏚᎵ ᎠᏎᏅ ᏥᏈᏍᏗ ᏓᎬᏩᎶᏗᏓᎾ.

source: I work in a store in the summer.
chr: ᎠᏓᎾᏅ ᏓᎩᎸᏫᏍᏓᏁᎰ ᎪᎩ ᏱᏄᎵᏍᏔᎾ.

source: When he heard the dog bark, he ran.
chr: ᎩᏟ ᏓᏑᏩᏍᎬ ᎤᏛᎦᎾ, ᎤᏓᏄᏩᏍᏔᏅᎢ.

source: The red light just changed.
chr: ᎩᎦᎨ ᎠᏨᏍᏛ ᎠᏓᏁᏟᏴᎾ.

source: When he got tired of guarding the prisoner, his friend took his place.
chr: ᏚᏯᏪᏣ ᎠᏴᎩ ᎠᎦᏘᏴ, ᎠᎾᎵᎢ ᎤᏓᏁᏟᏴᏍᏔᏅᎢ.

source: The ball players always have substitutes.
chr: ᎠᎾᏓᏁᏟᏴᏍᏗᏍᎩ ᏓᎾᏘᏁᎰ ᎠᎾᎳᏍᎦᎵᏍᎩ.

source: He gave a supply of food to the hungry.
chr: ᎠᎵᏍᏓᏴᏗ ᎠᏓᏁᏢ ᏚᏁᎸ ᏧᏂᏲᏏᏍᎩ.

source: A tornado destroyed a building.
chr: ᎤᏃᎴ ᎤᏲᏍᏔᏃᏅ ᎠᏓᏁᎸᎢ.

source: When the heart stops, a person dies.
chr: ᎠᏓᏅᏙ ᏳᎴᏫᏍᏔᎾ, ᎠᏲᎱᏍᎪ ᏴᏫ.

source: What are you thinking about?
chr: ᎦᏙ ᎤᏍᏗ ᎭᏓᏅᏖᎭ?

source: I'm just giving you something to think about.
chr: ᎪᏍᏗᏊ ᎢᏣᏓᏅᏖᏗ ᎢᏨᏁᎭ.

source: He's considering something I told him.
chr: ᎪᏍᏗ ᏥᏃᎯᏎᎸ ᎠᏓᏅᏖᎯᎶᎠ.

source: When you get close to a beaver, it makes noise.
chr: ᏙᏯ ᎾᎥ ᏱᎦᎷᏤᎳ ᎤᏓᏃᏴᏟᏍᏗᏍᎪᎢ.

source: A big snake is crawling.
chr: ᎤᏔᎾ ᎢᎾᏓ ᎠᏓᎾᏏᏂ.

source: When the twister hit the tree, it twisted.
chr: ᎠᎦᎷᎦ ᎤᏩᏂᎳ ᏡᎬᎢ ᎤᏓᏄᏖᏲᎸᎢ.

source: He lived in Tahlequah for ten years, the he wanted to move.
chr: ᏍᎪᎯ ᏧᏕᏘᏴᏓ ᎤᏁᎳᏛᎢ ᏓᎵᏆ, ᎩᎳ ᎤᏚᎷᎲ ᎤᏓᏅᏍᏗᎢ.

source: He orders a new car every year.
chr: ᏑᏕᏘᏴᏓ ᎢᏳᏓᎵ ᎢᏤ ᏓᏆᎴᎳ ᎠᏓᏅᏍᎪᎢ.

source: She's in the kitchen washing dishes.
chr: ᎠᏓᏍᏓᏴᏗ ᎠᏯᎠ ᏗᏖᎵᏙ ᏕᎬᏗᏰᎠ.

source: You don't have to cook, because I'm not hungry.
chr: Ꮭ ᎠᏎ ᏣᏓᏍᏓᏴᏗ ᏱᎩ, ᏝᎮᏃ ᏯᎩᎪᏏᎭ.

source: z
chr: x

source: Some Cherokees are very magical.
chr: ᏙᏳ ᎠᏂᏓᏪᎯ ᎨᏐ ᎢᎦᏓ ᎠᏂᏣᎳᎩ.

source: The match is burning.
chr: ᎠᏥᎳ ᎪᏢᏗ ᎠᏓᏪᎳᎩᎠ.

source: The flame burned his back.
chr: ᎠᏓᏪᎳᎩᏍᎩ ᏚᎴᏴᏔᏅ ᎦᏐᎯᎢ.

source: My dad has worked at a place where they make gunpowder.
chr: ᎠᏓᏪᎳᎩᏍᎩ ᎤᏃᏢᏗ ᏧᎸᏫᏍᏓᏁᎸ ᎡᏙᏓ.

source: Rest. You'll get exhausted.
chr: ᎭᏓᏪᏐᎸᏍᏓ. ᏙᏔᏍᏔᏰᏎᎦ.

source: A man named Adam wants to speak to you.
chr: ᎠᏓᏫ ᏧᏙᎢᏓ ᎠᏍᎦᏯ ᎤᏚᎵ ᏍᏓᏟᏃᎮᏗ.

source: Do you like to swim?
chr: ᏣᎸᏉᏗᏍ ᏣᏓᏬᏍᏗ?

source: I like to swim in a creek more than in a swimming pool.
chr: ᎤᏪᏴ ᎠᏆᏓᏬᏍᏗ ᎤᎪᏗ ᎠᎩᎸᏉᏗ ᏏᏅ ᎠᏓᏬᏍᏗ ᎨᏒᎢ.

source: Where did you get the color television?
chr: ᎭᏢ ᏣᎩᏎ Ꮎ ᎤᎵᏑᏫᏓ ᎠᏓᏴᎳᏛᏍᎩ?

source: He gave the students a new pencil.
chr: ᎢᏤ ᏗᎪᏪᎶᏗ ᎤᏕᎸ ᏗᏕᏠᏆᏍᎩ.

source: Is it easy to learn to speak Cherokee?
chr: ᎠᎯᏓᏍ ᎠᏕᎶᏆᏍᏗ ᏣᎳᎩ ᎦᏬᏂᎯᏍᏗ?

source: She's trying to embarrass him.
chr: ᎤᏕᎰᎯᏍᏙᏗ ᎠᏁᏟᏗᎭ.

source: When the girl winked at him, he got embarrassed.
chr: ᎠᎨᏳᏣ ᎤᎦᏔᏍᏓᏁᎳ ᎤᏕᎰᏒᎢ.

source: He was born at five o'clock this morning.
chr: ᎯᏍᎩ ᎢᏳᏩᏂᎸ ᏥᎨᏒ ᎪᎯ ᏑᎾᎴ ᎤᏕᏅᎢ.

source: The love of money is the root of evil."
chr: "ᎠᏕᎳ ᎠᎨᏴᏗ ᎨᏒ ᏗᏓᎴᏂ ᎠᏍᎦᏂ."

source: Would you like to work in a bank?
chr: ᏱᏣᏚᎳᏍ ᎠᏕᎵᏗᏴᏗ ᏗᏣᎸᏫᏍᏓᏁᏗ?

source: She wants to go to California.
chr: ᎠᏕᎵᏧᏢ ᎤᏪᏅᏍᏗ ᎤᏚᎵᎭ.

source: He found out that he was being cheated.
chr: ᎤᏕᎶᎰᏒ ᎠᏥᎶᏄᎡᏍᎬᎢ.

source: The price of this hat is ten dollars.
chr: ᎯᎠ ᎠᎵᏍᏇᏚᏬ ᏍᎪ ᎠᏕᎸ ᏧᎬᏩᏟᏗ.

source: I like to dive when I'm swimming.
chr: ᎠᏆᏕᏘᏗ ᎠᎩᎸᏉᏗ ᏱᎦᏓᏬᎠ.

source: I am circling a building.
chr: ᎠᏓᏁᎸ ᎦᏕᏲᎭ.

source: Because he was driving fast, he missed the curve.
chr: ᎠᏯᏄᎵ ᎠᎯᎵᏒ ᎢᏳᏍᏗ ᏚᏅᏛ ᎠᏕᏲᎲᎢ.

source: I am going to lay this fishing pole here.
chr: ᎠᎭᏂ ᏓᏥᏗ ᎯᎠ ᏍᏗ.

source: I rise at six a.m.
chr: ᏑᏓᎵ ᎢᏳᏩᏂᎸ ᏑᎾᎴ ᎦᏗᏗᏍᎪᎢ.

source: He scattered the papers on the table when he looked for his pencil.
chr: ᏗᎪᏪᎵ ᎦᏍᎩᎸ ᏚᏝᎥ ᏚᏗᎦᎴᏴ ᏗᎪᏪᎶᏓ ᎤᏯᎳ.

source: Pieces of cloth scattered when the wind blew hard.
chr: ᎠᎿᏬ ᎤᎵᎬᎭᎷᏴ ᎤᏗᎦᎴᏲᏨ ᏍᏓᏯ ᎤᏃᎸᎾ.

source: The wheel is spinning too fast to stop.
chr: ᎠᏯᏄᎵ ᎠᏗᏆᎸᏕᏲᎭ ᎦᏉᏛ ᎠᎴᏫᏍᏙᏙᏗᎢ.

source: What is he saying?
chr: ᎦᏙ ᎤᏍᏗ ᎠᏗᎭ?

source: Crossing the road, I was almost run over by a car.
chr: ᏅᏃᎯ ᏕᏥᎾᏗᏫᏍᎬ ᎠᎴ ᏓᏆᎴᎳ ᎾᏆᏗᏅᏔᏅᎢ.

source: When the killer saw the police he hid.
chr: ᏗᎾᏓᏂᏰᏍᎩ ᏚᎪᎭ ᏗᏓᎯᎯ ᎤᏗᏍᎦᎳᏅᎢ.

source: Leave the chair. There isn't room to put it in the car.
chr: ᎯᏗᏏᏯ ᎦᏍᎩᎶ. Ꮭ ᏳᏜᏅᏓ ᎦᎳᏗᏍᏗ ᏓᏆᎴᎷᎢ.

source: What kind of a drink do you want?
chr: ᎦᏙ ᎤᏍᏗ ᎠᏗᏔᏍᏗ ᏣᏚᎵ?

source: Camels drink a lot of water.
chr: ᎨᎻᎵ ᏥᏈᏍᏗ ᎠᎹ ᎠᎾᏗᏔᏍᎪᎢ.

source: He's drinking soup with a spoon.
chr: ᎠᏗᏙᏗ ᎬᏗ ᎠᏗᏔᏍᎦ ᎤᎦᎹ.

source: I see smoke from burning rubber.
chr: ᎠᏜ ᎠᎪᎲᏍᎬ ᏚᎦᏒᏍᏛ ᏥᎪᏩᏘᎭ.

source: The boy is scratching where a mosquito bit him.
chr: ᏙᏌ ᎤᏍᎦᎯᏨ ᎠᏜᎪᏍᎦ ᎠᏧᏣ.

source: The money is in the coat pocket.
chr: ᎦᏌᎴᏂ ᎠᏜᏩᏛ ᏕᎦᏝ ᎠᏕᎳ.

source: Where did he turn off?
chr: ᎭᏢ ᎢᏴ ᎤᏞᏎᎢ.

source: He wanted to take revenge against him but he didn't do it.
chr: ᎤᏞᏤᏗ ᎤᏚᎸᎲ ᎠᏎᏍᎩᏂ Ꮭ ᎥᏍᎩ ᏰᏄᏛᏁᎴᎢ.

source: Don't be looking for revenge.
chr: ᎮᏍᏗ ᎠᏞᎢᏍᏗ ᏰᏣᏲᎮᏍᏗ.

source: She puts on an apron when she works in the kitchen.
chr: ᎠᏞᏌᏙ ᎠᏞᏌᏛᎢᏍᎪ ᎠᏓᏍᏓᏴᏗ ᏱᏚᎸᏪᏍᏓᏁᎳ.

source: I didn't see the turn-off.
chr: Ꮭ ᏱᏥᎪᏩᏔ ᎠᏞᏍᎬᎢ.

source: What is she pouring? Milk or water?
chr: ᎦᏙ ᎤᏍᏗ ᎠᏟᎠ. ᎠᎹ, ᎤᏅᏗᎨ?

source: They have some pretty earrings at the Cherokee Arts and Crafts in Tahlequah.
chr: ᏧᏬᏚᎯ ᏗᏟᎠᏙ ᏚᏂᎭ ᎠᏂᏣᎳᎩ ᎤᏃᏢᏅᏅ ᎤᎾᏓᎾᏅᎢ ᏓᎵᏆ.

source: While I was swimming, water filled my ear.
chr: ᎦᏓᏬᏍᎬ, ᎠᎹ ᎤᏟᏨ ᏥᎴᏂ.

source: He's drawing water from the barrel.
chr: ᎠᎹ ᎠᏟᎭ ᏒᏙᏂᎢ.

source: What is she pouring it into? A glass or a bottle?
chr: ᎦᏙ ᎤᏍᏗ ᎠᏟᏍᏗᎭ? ᎤᎸᏌᏗᏍ ᎫᎫᎨ?

source: I want five oil containers.
chr: ᎯᏍᎩ ᎪᎢ ᏗᏗᎵᏍᏙᏗ ᏓᏆᏚᎵᎭ.

source: Don't cry.
chr: ᏞᏍᏗ ᏣᏠᏱᎸᎢ.

source: Because of his old age, he barely got off his horse.
chr: ᎠᎦᏴᎵᏴ ᎢᏳᏍᏗ, ᏎᎦᏨ ᎤᏠᎢᏒ ᏐᏈᎵᎢ.

source: All he does is just brag when he speaks.
chr: ᎠᏢᏈᏍᎬᏊ ᎢᎦ ᎨᏐ ᏳᏬᏂᏌ.

source: Do you think you can catch up with him?
chr: ᎡᎵᏊᏍ ᏱᏯᏢᏔ ᎮᎵ?

source: He makes walking canes by carving wood.
chr: ᏗᏙᎳᏅᏍᏗ ᏕᎪᎸᏍᎪ ᎠᏓ ᏓᏲᏢᏍᎬᎢ.

source: Do you know anyone who is an apprentice sorcerer?
chr: ᎯᏲᎵᎩᏍ ᎩᎶ ᎠᏙᏂᏍᎩ ᎠᏕᎶᏆᏍᎩ?

source: Where does one find freedom?
chr: ᎭᏢ ᎠᏩᏛᏗ ᎠᏚᏓᎴᏍᏗ?

source: This German is my friend.
chr: ᎯᎠ ᎠᏛᏥ ᎣᎦᎾᎵᎢ.

source: What will you be doing Saturday?
chr: ᎦᏙ ᎭᏛᏁᎮᏍᏗ ᏙᏓᏈᏕᎾ?

source: He's acting silly because he wants to be laughed at.
chr: ᎠᏥᏰᏣᏍᏙᏗ ᎤᏚᎵᎬ ᎢᏳᏍᏗ ᎠᏛᏁᎵᎭ.

source: The student is studying to become an actor .
chr: ᎠᏛᏁᎵᏍᎩ ᎢᏳᎵᏍᏙᏗ ᎠᏕᏠᏆᎠ ᏗᏕᎶᏆᏍᎩ.

source: I'm getting ready to go somewhere. She prepares a lot of food at Christmas.
chr: Ꮲ ᎠᏇᏅᏍᏗ ᎦᏛᏅᎢᏍᏗᎭ. ᏥᏈᏍᏗ ᎠᎵᏍᏓᏴᏗ ᎠᏛᏅᎢᏍᏗᏍᎪ ᏓᏂᏍᏓᏲᎯᎲᎢ.

source: When children play on the ground, they become dirty.
chr: ᎦᏙᎯ ᏱᏚᎾᏁᎶᎿ ᏗᏂᏲᏟ, ᎠᏂᎦᏓᎭ ᎾᎾᎵᏍᏗᏍᎪᎢ.

source: He's always eager to help.
chr: ᏂᎪᎯᎸ ᎠᎦᏟᏱ ᎨᏐ ᎤᏓᏍᏕᏟᏗᎢ.

source: The moon shines brightly if it's a full moon .
chr: ᎤᏍᎪᏍᏗ ᎠᎦᎵᏍᎪ ᏅᏓ ᎢᏳᏃ ᎧᎵ ᏅᏓ ᏱᎩ.

source: The girl wants to cut her hair.He broke the string with his hands.
chr: Ꮎ ᎠᎨᏳᏣ ᎤᏍᏘᎬ ᎤᏚᎵ. ᏧᏬᏰᏂ ᎬᏗ ᎤᎦᎳᏍᏒ ᎠᏍᏘ.

source: Some twisters are small and some are big .
chr: ᎢᎠᏓ ᎠᎦᎷᎦ ᏧᏍᏗ ᎨᏐ, ᎢᎦᏓᏃ ᏧᏔᎾ.

source: Cows like to lick salt.
chr: ᎠᎹ ᎤᏂᎦᎾᏗᏍᏗ ᎤᏂᎸᏉᏗ ᏩᎦ.

source: I was in the doctor's office.
chr: ᎠᎦᎾᎦᏘ ᎤᏴᏍᏗ ᏫᏥᏯᎥᎢ.

source: He's warming his feet.
chr: ᏧᎳᏏᏕᏂ ᏓᎦᎾᏬᏗᎭ.

source: When it becomes warmer, it gets warm.
chr: ᎪᎩ ᏱᏄᎵᏍᏔᎾ ᎠᎦᎾᏬᏍᎪᎢ.

source: It's raining too much to go somewhere today.
chr: ᏥᏈᏍᏗ ᎠᎦᏍᎦ ᏢᎡᏅᏍᏗ ᎪᎯ ᎢᎦ.

source: This man is a specially selected speaker.
chr: ᎯᎠ ᎠᏍᎦᏯ ᎠᏎ ᎠᎦᏑᏰᏓ ᎤᏬᏂᎯᏍᏗᎢ.

source: Cherokees use a seine to catch crawdads.
chr: ᎠᎦᏯᎷᏗ ᎠᏅᏗᏍᎪ ᏥᏍᏛᎾ ᏓᏂᏂᏱᏍᎬ ᎠᏂᏣᎳᎩ.

source: My uncle has an old squirrel dog.
chr: ᎠᎦᏴᎵ ᏌᎶᎵ ᏧᏲ ᎩᏟ ᎤᏩᎦ ᎡᏚᏥ.

source: The old woman has been teaching for twenty years.
chr: Ꮎ ᎠᎦᏴᎵᎨ ᏔᎵᏍᎪᎯ ᎾᏕᏘᏯ ᏁᎬᏕᏲᎤᎲᏍᎪᎢ.

source: I am going over there for a while.
chr: ᎠᎨ ᏫᏓᎨᏙᎵ ᏞᎦ.

source: Who is that woman?
chr: ᎦᎪ ᎥᏍᎩᎾ ᎠᎨᏯ?

source: Cherokee girls like to play ball.
chr: ᎠᏂᏣᎳᎩ ᎠᏂᎨᏳᏣ ᎤᏂᎸᏉᏗ ᎤᎾᎳᏍᎦᏟᏗᎢ.

source: The Cherokees like to eat corn bread.
chr: ᏎᎷ ᎦᏚ ᎤᏂᎩᏍᏗ ᎤᏂᎸᏉᏗ ᎠᏂᏣᎳᎩ.

source: When he saw money on the ground, he picked it up. Every two years he gets a new car.
chr: ᎠᏕᎳ ᎤᎪᎭ ᎦᏙᎯ ᎠᎲ ᎤᎩᏍᏒᎢ. ᏔᎵ ᏧᏕᏘᏴᏓ ᎢᏳᏓᎵ ᎢᏤ ᏓᏆᎴᎳ ᎠᎩᏍᎪᎢ.

source: The Trail of Tears was agony for the Cherokee.
chr: ᎠᏂᏣᎳᎩ ᏗᎨᏥᎢᎢᎸᏍᏔᏅ ᎠᎩᏟᏱ ᎨᏎᎢ.

source: He was in pain for two days.
chr: ᏔᎵ ᏧᏒᎯᏓ ᎢᎪᎯᏓ ᎤᎩᏟᏲᏨᎢ.

source: My horse has a colt.
chr: ᏐᏈᎵ ᎠᏆᏤᎵ ᎠᎩᎾ ᎤᏩᎧᎭ.

source: Get something to eat at the store.
chr: ᎪᎱᏍᏗ ᎠᎩᏍᏗ ᎯᎩᏒ ᏗᏓᎾᏅᎢ.

source: The woman always chews gum.
chr: Ꮎ ᎠᎨᏯ ᏂᎪᎯᎸ ᏥᎳᎵ ᎠᎩᏍᏙᏍᎪᎢ.

source: I see ten hens and one rooster.
chr: ᏍᎪᎯ ᎢᏯᏂᎢ ᏥᏔᎦ ᎠᏂᎩᏏ ᏕᏥᎪᏩᏘᎭ, ᏌᏊᏅ ᎠᏨᏯ.

source: He's burning old papers.
chr: ᏗᎪᏪᎵ ᏧᏪᏘ ᏓᎪᎲᏍᏗᎭ.

source: When the car overturned it started burning.
chr: ᏓᏆᎴᎳ ᏚᏟᏆᏗᎾ ᎠᎪᎲᏍᎬ ᎤᏓᎴᏅᎲᎢ.

source: Perch are good to eat.
chr: ᎠᏂᎪᎳ ᎠᏃᏍᏓ ᏗᎦᏰᏍᏗ.

source: I am reading a letter from a friend. The patient wanted a doctor to examine him.
chr: ᎣᏂᎦᎵᎢ ᏂᏓᏳᏅᏅ ᎪᏪᎵ ᏥᎪᎴᏰᎠ. ᎠᎦᎾᎦᏘ ᎤᎪᎵᏰᏗ ᎤᏚᎵᏍᎬ ᎤᏢᎩ.

source: Have you gone through famine?
chr: ᎠᎪᎾᏍ ᏣᎶᏒᎯ?

source: He's target practicing with a new bow.
chr: ᎢᏤ ᎦᎵᏣᏗ ᎬᏗ ᎠᎪᏂᎭ.

source: Rabbits ate up her lettuce.
chr: ᏥᏚ ᎬᏩᏒᏁᎸ ᎠᎪᏍᏓᎩᏍᏗ.

source: The lion ate some raw meat.
chr: ᎠᎪᏍᏗ ᎭᏫᏯ ᎤᎬ ᏢᏓᏥ.

source: Don't you see it?
chr: ᏝᏍ ᏱᎪᏩᏘ?

source: The green grass is really a beautiful sight.
chr: ᎢᏤ ᎦᏄᎸᏒ ᏙᎯᏳ ᎤᏬᏚᎯ ᎠᎪᏩᏛᏗ ᎨᏐᎢ.

source: Your mother wants to see a picture of you.
chr: ᏤᏣᏟᎶᏍᏔᏅ ᎤᎪᏩᏛᏗ ᎤᏚᎵ ᏣᏥ.

source: This boy is a Creek Indian.
chr: ᎯᎠ ᎠᏧᏣ ᎠᎫᏌ ᎠᏴᏫᏯᎢ.

source: When the catcher missed catching the ball, it hit him on his forehead.
chr: ᎦᏂᏱᏍᎩ ᏍᏆᏞᏍᏗ ᎦᏂᏱᏍᎬ ᏚᏅᏓ ᎠᎬᏓᎨᏂ ᎤᏩᏂᎸᎢ.

source: She cut a pattern for a dress. She's slicing the cake with a knife.
chr: ᎠᏌᏃ ᎤᏬᏢᏗ ᎤᎬᎭᎸᎲᎢ. ᎭᏰᎵᏍᏗ ᎬᏗ ᎠᎬᎭᎵ ᎦᏚ ᎤᎦᎾᏍᏓ.

source: Chop up some cabbage to cook.
chr: ᏧᎦᏅᏕᎾ ᎬᏂᏍᏙᏗ ᎯᎬᎭᎷᏯ.

source: Give me a piece of cake.
chr: ᎦᏚ ᎤᎦᎾᏍᏓ ᎠᎬᎭᎸᏓ ᏍᎬᏏ.

source: Is your friend a white person or black?
chr: ᎠᏲᏁᎦᏍ ᏍᏓᎵᎢ, ᎠᎬᎿᎨᎢᎨ?

source: The man is scolding his son.
chr: Ꮎ ᎠᏍᎦᏯ ᎤᏪᏥ ᎠᏧᏣ ᎠᎬᏍᎪᎸᏍᎦ.

source: A cat washes its face after it eats.
chr: ᏪᏌ ᏳᎵᏍᏓᏴᏃᎿ ᎠᎬᏉᏍᎪᎢ.

source: Nobody likes a loudmouth.
chr: Ꮭ ᎩᎶ ᏳᎸᏉᏗ ᎠᎭᎳᏓ.

source: Flag that door down.
chr: ᎯᎠᎷᎩ Ꮎ ᏓᏆᎴᎳ.

source: Let's meet here after a while.
chr: ᎠᎭᏂ ᏙᎾᏠᏒᎢ ᎪᎯ ᏴᎢ.

source: Deer meat is good to eat.
chr: ᎠᏫ ᎭᏫᏯ ᎣᏍᏓ ᎠᎩᏍᏗ.

source: When I closed the window, I smothered it.
chr: ᏦᎳᏂ ᏓᎦᏍᏚᎿ ᏥᎠᏬᏍᏔᏅᎢ.

source: Some snakes are not easy to see.
chr: ᎢᎦᏓ ᎢᎾᏓ Ꮭ ᎠᎯᏓ ᏱᎩ ᏗᎪᏩᏛᏗ.

source: What do you have in your hand?
chr: ᎦᏙ ᎤᏍᏗ ᎯᎯᏙᎭ.

source: I killed seven squirrels when I went hunting.
chr: ᎦᎵᏉᎩ ᎢᏯᏂᎢ ᏌᎶᎵ ᏕᎦᏥᎸ ᎠᎩᏃᎭᎴᎾ.

source: He's driving his dad's car.
chr: ᎤᏙᏓ ᎤᏤᎵ ᏓᏆᎴᎳ ᎠᎯᎴᎭ.

source: He's driving the cattle toward the pasture.
chr: ᏠᎨᏏ ᏗᏜ ᏓᎯᎵ ᏩᎦ.

source: Something happened to the steering wheel.
chr: ᎪᎱᏍᏗ ᎦᎵᏍᏓ ᎠᎯᎸᏍᏗᎢ.

source: Leave the car when you go back.
chr: ᎯᎯᏴᎢ Ꮎ ᏓᏆᎴᎳ ᎢᎭᏂᎩᏒᎢ.

source: Put the bottle on the table.
chr: ᎦᏍᎩᎸ ᎯᏝᎲᎦ Ꮎ ᎫᎫ.

source: When something scares a bird, it flies away.
chr: ᎪᎱᏍᏗ ᏳᏍᎦᏍᏓᏁᎳ ᏥᏍᏆ, ᎠᏜᏫᏗᏍᎪᎢ.

source: Do you want something that flies?
chr: ᎪᎱᏍᏗ ᎠᏝᏫᏗᏍᎩ ᏣᏚᎵ?

source: He likes to fly a toy airplane.
chr: ᏥᏳ ᏗᏁᏟᏙᏗ ᎤᎸᏉᏗ ᎤᏝᏫᏘᏙᏗ.

source: Are you the one who flies this plane?
chr: ᏂᎯᏍ ᎭᏝᏫᏘᏗᏍᎩ ᎯᎠ ᏥᏳ?

source: When he has eaten a lot, he has a nightmare.
chr: ᏥᏈᏍᏗ ᎤᎵᏍᏓᏴᏅ ᏱᎩ ᎠᏘᎩᏍᎪᎢ.

source: How long did it take for you to get a haircut?
chr: ᎯᎠ ᎢᎪᎯᏓ ᎤᏟᎢᎵᏙᎴ ᎡᏣᏙᏰᏍᎬ?

source: A carpenter uses a ruler in measuring the place where he cuts the board.
chr: ᏗᏁᏍᎨᏍᎩ ᎠᏟᎶᏍᏗ ᎬᏗᏍᎪ ᎠᏟᎶᏍᎬ ᎢᏴ ᎤᏍᏆᎵᏍᏗ ᏯᏖᎾ.

source: Hand me a ruler.
chr: ᎠᏟᎶᏍᏗ ᎡᏍᎩᏗᏏ

source: When he hit the steel post with a car, it bent.
chr: ᏓᏆᎴᎳ ᎬᏗ ᎤᏩᏂᎳ ᏔᎷᎩᏍᎩ ᎨᏛ, ᎤᏟᏴᏈᏛᏅᎢ.

source: When a deer is trying to scare something, it snorts .
chr: ᎪᎱᏍᏗ ᏯᏍᎦᏍᏓᏁᎭ ᎠᏫ, ᎠᏟᏴᏌᎾᏩᏗᏍᎪᎢ.

source: He preached for one hour .
chr: ᏑᏟᎶᏓ ᎢᎪᎯᏓ ᎤᎵᏣᏙᏅᎢ

source: Three of his sons became preachers.
chr: ᏦᎢ ᎢᏯᏂ ᏧᏪᏥ ᎠᏂᏧᏣ ᎠᎾᎵᏣᏙᎲᏍᎩ ᏄᎾᎵᏍᏔᏅᎢ.

source: When the ball hit the window, it shattered.
chr: ᏍᏆᏞᏍᏗ ᎤᏩᏂᎳ ᏦᎳᏂ, ᎤᎵᎪᏛᏅᎢ.

source: He shatters the bottles by shooting them.
chr: ᏓᏲᎯᎲ ᏓᎵᎪᏛᏗᏍᎪ ᎫᎫ.

source: I like to play records.
chr: ᏗᏠᏗ ᏗᏆᏁᏟᏙᏗ ᎠᎩᎸᏉᏗ.

source: When we played ball by ourselves, I beat him.
chr: ᎣᎩᏅᏌ ᎣᎩᎾᎳᏍᎦᎸᎭ, ᏥᏠᏒᎢ.

source: She combs her hair all the time, and that's why she has pretty hair.
chr: ᏂᎪᎯᎸ ᎠᎵᏔᏬᏍᎪ, ᎤᏍᎩᏅ ᎢᏳᏍᏗ ᎤᏬᏚᎯ ᏧᏍᏘᎦ.

source: I want to buy a comb
chr: ᎠᎵᏔᏬᏍᏗ ᎠᎩᏩᎯᏍᏗ ᎠᏆᏚᎵ.

source: The snake isn't dead . It's still moving.
chr: Ꮭ ᎤᎵᏬᏨ ᏱᎩ Ꮎ ᎢᎾᏓ. Ꮟ ᎠᎵᏖᎸᎲᏍᎦᏊ.

source: When his shirt got dirty, he changed it.
chr: ᎦᏓᎭ ᏄᎵᏍᏔᎾ ᎤᎿᎠᏬ, ᎤᎿᏩᎢᏴᏒᎢ.

source: When it got warm, he took off his coat.
chr: ᎤᎦᎾᏬᏌ, ᎤᎿᏪᏒ ᎦᏌᎴᏂ

source: I have a shirt made of cowhide.
chr: ᏩᎦ ᎨᎦ ᎪᏢᏔᏅ ᎠᎿᏬ ᎠᎩᎾᎠ.

source: She was given a new coat, but she didn't wear it.
chr: ᎢᏤ ᎦᏌᎴᏂ ᎠᏥᏅᏁᎸ ᎠᏎᏅ Ꮭ ᏳᎿᏬᎡᎢ.

source: He gave his son ten dollars.
chr: ᏍᎪᎯ ᎠᏕᎸ ᎤᏁᎸ ᎤᏪᏥ ᎠᏧᏣ.

source: Indians like to wrestle.
chr: ᎠᏂᏴᏫᏯ ᎤᏂᎸᏉᏗ ᎤᎾᏁᏍᏗ

source: He's interpreting the speaker's speech.
chr: ᎦᏬᏂᏍᎩ ᎦᏬᏂᏍᎬ ᎠᏁᏟᏗᎭ.

source: I want a translation of this book.
chr: ᎯᎠ ᎪᏪᎵ ᎠᏁᏟᏔᏅ ᎠᏆᏚᎵᎭ

source: The children are frolicking in the grass
chr: ᎦᏄᎸᎯ ᎠᎾᏁᏦᏍᎦ ᏗᏂᏲᏟ.

source: The carpenter built a big chicken house.
chr: Ꮎ ᏗᏁᏍᎨᏍᎩ ᎤᏔᎾ ᏥᏔᎦ ᎤᏂᏴᏍᏗ ᎤᏁᏍᎨᎲᎢ.

source: He left yesterday morning. When he put a new battery in the car, it started up easily.
chr: ᏒᎯ ᏑᎾᎴ ᏥᎨᏒ ᏧᏂᎩᏒᎢ. ᎢᏤ ᎠᎾᎦᎵᏍᎩ ᎤᏝᎾ, ᎠᎯᏓ ᎤᏂᎩᏒ ᏓᏆᎴᎳ.

source: He wants to start the car but he doesn't have the keys.
chr: ᏓᏆᎴᎳ ᎤᏂᎩᏍᏙᏗ ᎤᏚᎵ, ᎠᏎᏅ Ꮭ ᏗᏍᏚᎢᏍᏗ ᏱᏚᏩᏯ.

source: He carried three posts on his shoulder.
chr: ᏦᎢᎭ ᏗᎨᏛᏍᏗ ᏚᏃᏟᏅᏒᎢ.

source: He burned his mouth drinking hot soup.
chr: ᎠᎰᎵ ᎤᎴᏴᏒ ᎤᏗᏞᎩ ᎤᎦᎹ ᎠᏥᏔᏍᎬᎢ.

source: She's putting some corn in the boiling water.
chr: ᎠᎹ ᎠᎵᏟᏍᎬ ᏓᎱᏗᎠ ᏎᎷ.

source: Where can I find some stove pipes?
chr: ᎭᏢ ᏱᏕᏥᏴᏩᏔ ᎣᏏ ᏗᎱᏣᏬᎳᏛᏗ?

source: If you will look just a little to the left, you will see a chimney.
chr: ᏍᏗᎩᏓᏊ ᎠᎦᏍᎦᎾᎢ ᏗᏜ ᏳᏗᏣᎧᎿᎾ, ᏳᏫᎪᏩᏔ ᎠᎱᏣᏬᎳᏛᎢ.

source: Indians use a drum when they chant.
chr: ᎠᏂᏴᏫᏯ ᎠᎾᏴᎴᎬ ᎠᎱᎵ ᎠᏅᏗᏍᎪᎢ.

source: He wanted to hit him on the mouth, but he got scared.
chr: ᎤᎱᎸᏂᏍᏗ ᎤᏚᎵᏍᎬ, ᎠᏎᏅ ᎤᏍᎦᎸᎢ.

source: Move the car. It's in the way.
chr: ᎯᎲᎾ ᏓᏆᎴᎳ. ᎢᎬᏱ ᏗᏜ ᎠᎭ.

source: Set the groceries down.
chr: ᎡᎳᏗ ᎯᎲᎦ ᎠᎵᏍᏓᏴᏗ

source: When something is hidden from him, he finds it easily
chr: ᎪᎱᏍᏗ ᏯᎬᏍᎦᎳᏁᎳ, ᎠᎯᏓ ᎠᏩᏘᏍᎪᎢ.

source: Who do you want to visit?
chr: ᎦᎪ ᎯᏩᏛᎯᏓᏍᏗ ᏣᏚᎵ?

source: He took the ball home with him.
chr: ᏧᏪᏅᏒ ᎤᏫᏛᎲ ᏍᏆᏞᏍᏗ.

source: She planted flowers near the building.
chr: ᎠᏂᏥᎸᏍᎩ ᏚᏫᏒ ᎠᏓᏁᎸ ᎾᎥᎢ.

source: Do you want to buy a necktie?
chr: ᎠᏯᏢᏗᏍ ᏣᏩᎯᏍᏗ ᏣᏚᎵ?

source: Peel some potatoes.
chr: ᏄᎾ ᏘᏯᎨᏗᏌ.

source: She received a pretty necklace for her birthday.
chr: ᎤᏬᏚᎯ ᎠᏯᏟᏗ ᎤᎩᏒ ᎤᏕᏘᏱᏍᎬᎢ.

source: Did it frost last night?
chr: ᎤᏯᏛᏁᎢᏍ ᎤᏒ ᏥᎨᏒ?

source: He's calling the dog with a cow horn. Where did you get this dog?
chr: ᏩᎦ ᎤᏲᏂ ᎬᏗ ᎠᏯᏂᎭ ᎩᏟ. ᎭᏢ ᎯᏯᏅᎮ ᎯᎠ ᎩᏟ?

source: Where are you taking the ball?
chr: ᎭᏢ ᎯᏰᎦ ᏍᏆᏞᏍᏗ?

source: He had ten dollars worth of pennies in his hand.
chr: ᏍᎪᎯ ᎠᏕᎸ ᏧᎬᏩᏟᏗ ᏌᏊ ᎢᏯᎾᏓᏅᏞᏗ ᏓᏰᎲᎢ.

source: She quilted it with white cotton.
chr: ᎤᏁᎦ ᎤᏥᎸ ᎬᏗ ᎤᏰᎦᏝᏅᎢ.

source: The surgeon is operating on the patient.
chr: ᏗᏓᏰᏠᎯ ᎤᏢᎩ ᎠᏰᏠᎭ.

source: He imitates birds with his whistling. Who are you mocking?
chr: ᏥᏍᏆ ᏓᏰᎵᏍᎪ ᎦᏒᎬᎢ. ᎦᎪ ᎯᏰᎵᎠ?

source: I lost my knife while hunting.
chr: ᏥᏃᎠᎵᏙᎲ ᎠᎩᎰᎱᏎᎸ ᎭᏰᎵᏍᏗ

source: I'm looking for my friend. Where did he go?
chr: ᎣᎩᎾᎵᎢ ᏥᏲᎭ. ᎭᏢ ᏫᎦᎶᎯ?

source: How far can you swim?
chr: ᎯᎳ ᎢᏳᏓᏅᎯᏓ ᎡᎵᏊ ᏯᎱᎢᏄᎦ?

source: Do you hear it thundering?
chr: ᎭᏛᎩᎠᏍ ᎠᏴᏓᏆᎶᏍᎬ?

source: Are you afraid of thunder?
chr: ᎯᏍᎦᎰᎢᏍ ᎠᏴᏓᏆᎶᏍᎩ?

source: He wants to buy an air conditioner in the summer.
chr: ᎠᏴᏜᏗᏍᏗᏍᎩ ᎤᏩᎯᏍᏗ ᎤᏚᎵ ᎪᎩ ᎢᏴᎢ.

source: He made a six-foot ladder.
chr: ᏑᏓᎵ ᎢᎳᏏᏗ ᎢᎦᏅᎯᏓ ᎠᏴᏠ ᎤᏬᏢᏅᎢ

source: Don't bend it! When I finish sewing the quilt, I am going to hem it.
chr: ᏞᏍᏗ ᏥᎯᏴᏈᏛᏂ! ᏥᏍᏆᏛ ᏥᏰᏫᏍᎬ ᏰᎦᏟ, ᏓᏥᏴᏈᏛᏂ.

source: I was going to shoot a rabbit in his throat but I missed.
chr: ᎠᏴᏤᏂ ᏓᏥᏲᎵᏒ ᏥᏍᏚ ᎠᏎᏅ ᏕᎢᏅᏛᎢ.

source: He tried to kick above his head.
chr: ᎠᏍᎪᎵ ᎦᎸᎳᏗᏜ ᎤᏴᏖᏍᏗ ᎤᏁᏟᏔᏅᎢ.

source: Some soldiers have become prisoners.
chr: ᎢᎦᏓ ᎠᏂᏲᏍᎩ ᎠᏂᏴᎩ ᏄᎾᎵᏍᏔᎾ.

source: The soldier captured his enemy.
chr: ᏗᏂᏓᎿᏫ ᎤᏴᎩᏛ ᎠᏲᏍᎩ.

source: Who hit him on the nose?
chr: ᎦᎪ ᎤᏴᏍᏕᎷᏁᎢ.

source: The shirt collar is choking him.
chr: ᎠᎿᏬ ᎦᏯᏢ ᎤᏴᏍᎩᏱᎭ.

source: Someone is walking toward the building.
chr: ᏗᏓᏁᎸ ᏗᏜ ᏩᎢ ᎩᎶ.

source: How many fish did you catch?
chr: ᎯᎳ ᎢᏯᏂᎢ ᎠᏣᏗ ᏕᎯᏂᏴᎮ?

source: Is that man a Choctaw or Cherokee?
chr: ᎠᏣᏓᏍ Ꮎ ᎠᏍᎦᏯ, ᎠᏣᎳᎩᎨ?

source: How many chicks hatched?
chr: ᎯᎳ ᎢᏯᏂ ᏥᏔᎦ ᎠᏂᏓ ᎤᎾᏣᎢᏎᎢ?

source: When he goes to the city, he dresses up.
chr: ᎤᏔᎾ ᏗᎦᏚᎲ ᏳᏪᎾ ᎠᏣᏅᏍᎪᎢ.

source: Get in the car
chr: ᏓᏆᎴᎷ ᎭᏣᎥᎦ.

source: He is acting like an Indian.
chr: ᎠᏴᏫᏯ ᎠᏤᎸᏍᎦ.

source: The boys are wrestling on the mattress.
chr: ᎠᏤᏍᏙ ᎦᎾᎥ ᎠᎾᏁᎯᎲ ᎠᏂᏧᏣ.

source: He's spilling water on the ground.When he' s got a lot of money, he just wastes it.
chr: ᎦᏙᎯ ᎠᏤᏫᎠ ᎠᎹ. ᏥᏈᏍᏗ ᎠᏕᎳ ᏱᏚᎭ, ᏓᏤᏫᏍᎪᎢᏊ.

source: At the stomp dance grounds they dance around the fire.
chr: ᎠᏥᎳ ᎠᎲ ᎠᎾᏕᏲᎰ ᎠᎾᎵᏍᎩᏍᎬ ᎦᏘᏲᎢ.

source: Let's go look for some watercress.
chr: ᎠᎹᏱ ᎡᎯ ᎠᏥᎳ ᎢᎩᏯᎷᎦ.

source: A Catholic spoke at the meeting.
chr: ᎠᏥᎳ ᎨᏠᎯ ᎤᏬᏂᏒ ᏓᎾᏠᏍᎬᎢ

source: Give me a match.
chr: ᎠᏥᎳ ᎪᏢᏗ ᏍᎩᏗᏏ.

source: He threw coal into the fire.
chr: ᎠᏥᎸᎯ ᏭᏗᏅᏒ ᏥᏃᏍᎦ.

source: Flowers bloom in the spring.
chr: ᎪᎨᏱ ᎠᏂᏥᎸᏍᎪ ᎠᏂᏥᎸᏍᎩ.

source: Someone gave her some flowers.
chr: ᎠᏂᏥᎸᏍᎩ ᏚᏅᏏ ᎩᎶᎢ

source: A cedar is always green
chr: ᎠᏥᎾ ᏂᎪᎯᎸ ᎢᏤ ᎨᏐᎢ

source: He lit the cigarette with a match.
chr: ᎠᏥᎳ ᎪᏢᏗ ᎬᏗ ᎤᏥᎳᏅᎢ ᎪᎩᏍᏗ

source: He's blowing on the hot coffee.
chr: ᎧᏫ ᎤᏗᎴᎩ ᎠᏦᏔᏍᎦ.

source: Turn on the lights at six o'clock in the morning
chr: ᏑᏓᎵ ᎢᏳᏩᏂᎸ ᏑᎾᎴ ᏕᎯᏨᏍᏔᏅᎢ.

source: When lightning flashed, the electric lights went out.
chr: ᎤᎾᎦᎸᎭ, ᎠᎾᎦᎵᏍᎩ ᏗᏨᏍᏗ ᏚᏠᏒᎢ.

source: The policeman was given a badge.
chr: ᎠᎧᏁᏍᏗ ᎠᏥᏁᎸ ᏗᏓᏂᎢᏍᎦ.

source: He hurt his hip when he fell.
chr: ᎠᎧᏍᎨᏂ ᎤᏪᎯᏍᏓᏁᎸ ᎤᏅᏣ.

source: When the dog sees cows, he chases them.
chr: ᏩᎦ ᏱᏚᎪᎭ ᎩᏟ, ᏓᎨᎮᎪᎢ.

source: Where are the stairs?
chr: ᎭᏢ ᎢᏴ ᎪᎸ ᎠᎩᏠᏒᏍᏗᎢ?

source: He likes to ride a bicycle.
chr: ᏔᎵ ᏗᎦᏆᏘ ᎤᎩᎸᏙᏗ ᎤᎸᏉᏗ

source: The doctor gave the patient some pills.
chr: ᎠᎦᎾᎩᏘ ᏗᎩᏍᏗ ᏚᏁᎸ ᎤᏢᎩ.

source: I am barely swallowing because my throat hurts.
chr: ᏤᏴᏤᏂ ᎠᏇᎯᏍᏓᏁᎲ ᎢᏳᏍᏗ ᏎᎦᏨ ᏥᎩᏍᎦ.

source: I saw an elbow through an opening in the door.
chr: ᎠᎩᏳᏍᎨ ᎠᎩᎪᎲ ᎦᎶᎯᏍᏗ ᏭᏜᏅᏛᎢ.

source: His elbows got dirty when he crawled.
chr: ᏗᎩᏳᏍᎨᏂ ᏗᎦᏓᎭ ᏂᏚᎵᏍᏔᏅ ᎤᏓᎾᏏᏅᏌ.

source: She's shoveling a place to set out flowers.
chr: ᎠᏂᏥᎸᏍᎩ ᏧᏩᎪᏗ ᎠᎪᏕᎠ.

source: He's making a handle for a shovel.
chr: ᎠᎪᏕᏍᏗ ᎫᎭᏟᏗ ᎪᏢᏍᎦ.

source: He turned right but the others turned left.
chr: ᎠᎦᏘᏏ ᏗᏜ ᏭᏞᏒ ᎠᏂᏐᎢᏃ ᎠᎦᏍᎦᏂ ᏗᏜ ᏭᎾᏞᏒᎢ.

source: This ball player is left-handed.
chr: ᎯᎠ ᎠᎳᏍᎦᎵᏍᎩ ᎠᎦᏍᎦᏂᏓ.

source: He goes down a long hill when he goes after water.
chr: ᎦᏅᎯᏓ ᎠᎦᏐᏍᎬ ᎠᎦᏍᎪ ᎠᎹ ᏳᏁᎩᏎᎾ.

source: He pushed the car down-hill.
chr: ᎠᎦᏐᏍᎬ ᏭᏩᏌᏙᏴ ᏓᏆᎴᎳ.

source: He has one artificial eye.
chr: ᎠᎦᏔ ᎠᏰᎸᎯ ᎠᎧᎿ ᏌᏊᎢ.

source: Do you know how to speak Cherokee?
chr: ᎯᎦᏔᎭᏍ ᏣᎳᎩ ᏣᏬᏂᎯᏍᏗ?

source: Who is a witness to what happened?
chr: ᎦᎪ ᎠᎦᏔᎯ ᏄᎵᏍᏔᏂᏙᎸᎢ

source: This man is very knowledgeable.
chr: ᎯᎠ ᎠᏍᎦᏯ ᎤᏙᎯᏳ ᎠᎦᏔᎿᎢ.

source: When he heard someone calling him, he turned around. He wanted to turn back before he got there.
chr: ᎩᎶ ᎤᏯᏂᏍᎬ ᎤᏛᎦᎾ ᎤᎦᏔᎲᏒᎢ. ᏫᏄᎷᏨᎾᏊ ᎤᎦᏔᎲᏍᏗ ᎤᏚᎸᎲᎢ.

source: The boy is winking at the girl.
chr: Ꮎ ᎠᏧᏣ ᎠᎨᏳᏣ ᎠᎦᏔᏍᏓᏁᎭ.

source: He hit the boy in the eye with a rock
chr: ᏅᏯ ᎬᏗ ᎤᎦᏖᎷᏅ ᎠᏧᏣ.

source: The scenery is pretty in the spring.
chr: ᎤᏬᏚᎯ ᎨᏐ ᎠᎦᏖᎾᏍᏗ ᎪᎨᏱ.

source: I don't want anything. I'm just looking around.
chr: Ꮭ ᎪᎱᏍᏗ ᏯᏆᏚᎵ. ᏥᎦᏖᏃᎵᏙᎭᏊ.

source: Someone is peeking through the window.
chr: ᏦᎳᏂ ᎠᎦᏘᎭ ᎩᎶᎢ.

source: He throws a ball with his right hand.
chr: ᎠᎦᏘᏏ ᎬᏗ ᎤᏕᎪ ᏍᏆᏞᏍᏗ.

source: Wait for me. I'll be right back.
chr: ᏍᎩᎦᏘᏰᏍᏗ. ᎩᎳᏊ ᏛᏥᎷᏥ.

source: He was chosen to be a guard at the bank.
chr: ᎠᏕᎳ ᏗᏗ ᎠᎦᏘᏱ ᎠᎦᏑᏰᏒᎢ.

source: He wants a telescope for his birthday.
chr: ᎠᎦᏙᏗ ᎤᏚᎵ ᎤᏕᏘᏱᏍᎬᎢ.

source: He became wise when he was just a boy.
chr: ᎠᏧᏣᏊ ᏥᎨᏒ ᎤᎦᏙᎥᏒᎢ.

source: His right eye is always bothering him.
chr: ᎠᎦᏘᏏ ᎠᎦᏙᎵ ᏂᎪᎯᎸ ᎤᏕᏯᏙᏗᏍᎪᎢ.

source: Do you like to watch television?
chr: ᏣᎸᏉᏗᏍ ᎠᏓᏴᎳᏛᏍᎩ ᎭᎦᏙᏍᏙᏗ?

source: Some Cherokees have wisdom.
chr: ᎢᎦᏓ ᎠᏂᏣᎳᎩ ᎠᎦᏙᎥᎯᏍᏗ ᎤᏂᎭ.

source: He barely went through the small opening.
chr: ᏎᎦᏨ ᎤᎦᏛᎴᏒ ᎤᏍᏗ ᎤᏜᏅᏛᎢ.

source: She's dipping water from a bucket.
chr: ᏒᏙᏂ ᎠᎫᎩᎠ ᎠᎹ.

source: Where is the dipper? I'm thirsty (for water)
chr: ᎭᏢ ᎠᎫᎩᏍᏗ? ᎠᎹ ᎠᎩᏔᏕᎩᎠ.

source: I'm paying sixty dollars a month for my car.
chr: ᏑᏓᎵᏍᎪ ᎠᏕᎸ ᎦᏈᏱᎭ ᏓᏆᎴᎳ ᏏᏅᏓ.

source: How much did you pay him?
chr: ᎯᎳ ᎢᎦ ᎯᏯᏈᏴᎡᎴ?

source: Cherokees like feather pillows.
chr: ᏧᎩᏓᏟ ᏗᎦᏅᏗ ᏗᏈᏍᏙ ᏚᏂᎸᏉᏗ ᎠᏂᏣᎳᎩ.

source: He killed the snake by tromping on it. He always speaks badly of people.
chr: ᎠᎳᏍᏓᎡᏍᎬ ᎤᏢ ᎢᎾᏓ. ᏂᎪᎯᎸ ᏴᏫ ᏓᎳᏍᏓᎡᏍᎪᎢ.

source: There's a bug crawling. Step on it!
chr: ᏥᎪᏯ ᎠᏓᏏᏂ. ᎯᏯᎳᏍᏛᎥᎦ!

source: He didn't play ball because his hand was hurting.
chr: ᎤᏬᏰᏁ ᎤᏪᎯᏍᏓᏁᎲ ᎢᏳᏍᏗ Ꮭ ᏳᎳᏍᎦᎸᎮᎢ.

source: The ball players practice every day.
chr: ᏧᏙᏓᏋᏓ ᎠᎾᎵᏏᎾᎲᏍᏗᏍᎪ ᎠᎾᎳᏍᎦᎵᏍᎩ.

source: A crippled man takes a step carefully.
chr: ᎠᏲᎤᏟ ᎠᏍᎦᏯ ᎤᎦᏎᏍᏗ ᎠᎳᏍᎬᏍᎪᎢ.

source: The lawyer began working on a law suit.
chr: ᎠᎳᏑᏟᏗ ᏚᎸᏫᏍᏓᏁᎲ ᎤᎴᏅᎲ ᏗᏘᏲᎯᎯ

source: He forgot to polish the shoes.
chr: ᏗᎳᏑᎶ ᏧᎶᏁᏗ ᎤᏩᎨᏩ.

source: As I walked along the grass, I almost stepped on a snake.
chr: ᎦᏄᎸᎯ ᎦᎢᏒ ᎠᎴ ᎢᎾᏓ ᏂᏥᏯᎳᏍᏛᏔᏅᎢ.

source: I see men and women. If you want to go or not, that's just fine.
chr: ᎠᏂᏍᎦᏯ ᎠᎴ ᎠᏂᎨᏯ ᎦᏥᎪᏩᏘᎭ. ᏤᏅᏍᏗ ᏱᏣᏚᎵ, ᎠᎴ Ꮭ ᏱᎩ ᎣᏏᏊ.

source: He tried to stand a heavy piece of steel in an upright position.
chr: ᏔᎷᎩᏍᎩ ᎦᎨᏓ ᎤᎴᏙᏗ ᎤᏁᏟᏔᏅᎢ.

source: Stand here in the middle.
chr: ᎠᎭᏂ ᎠᏰᎵ ᎭᎴᎲᎦ.

source: When he heard someone calling him, he stopped.
chr: ᎩᎶ ᎤᏯᏂᏍᎬ ᎤᏛᎦᎾ, ᎤᎴᏫᏍᏔᏅᎢ.

source: When can you start working?
chr: ᎯᎳᏴ ᎡᎵᏊ ᏯᎴᎾ ᏕᏣᎸᏫᏍᏓᏁᎲ?

source: The coffee is boiling.
chr: ᎧᏫ ᎠᎵᏟᎭ.

source: His shirt was soaked with sweat.
chr: ᎠᎵ ᏚᏖᎡᏒ ᎤᏄᏮᎢ.

source: The Indian with the long hair wants a headband.
chr: Ꮎ ᎦᏅᎯᏓ ᎤᏍᏘᎩ ᏥᎩ ᎠᏴᏫᏯ ᎠᎵᎬᏓᏃᏍᏙᏗ ᎤᏚᎵᎭ.

source: Firemen use protective masks.
chr: ᏗᏅᏜᏗᏍᎩ ᏗᎵᏍᏕᎸᏙᏗ ᏗᎵᎬᏚᎶ ᏓᎾᏗᏍᎪᎢ.

source: When his son helps him work, he thanks him.
chr: ᎤᏪᏤ ᎠᏧᏣ ᏳᏍᏕᎸᎭ ᏚᎸᏫᏍᏓᏁᎲ, ᎠᎵᎮᎵᏤᎰᎢ.
